ghye/stm32_car/lw_gprs.c
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>

#include "stm32f10x.h" //"stm32f10x_nvic.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_usart.h"

#include "lw_gprs.h"
#include "lw_stm32_uart.h"
#include "ctrl_gps_cam.h"

#define GPRS_MAX_MSG_LEN 512 //64
#define GPS_MAX_MSG_LEN 0xff

#define M_RST GPIO_Pin_8
#define M_ON GPIO_Pin_9
#define MG323_RESET() 	GPIO_SetBits(GPIOC, M_RST) /* 硬件复位>= 10ms */
#define MG323_NORM() GPIO_ResetBits(GPIOC, M_RST)
#define MG323_POWERSWITCH() GPIO_SetBits(GPIOC, M_ON)	/*开/关切换>=1s*/
#define MG323_POWERNORM() GPIO_ResetBits(GPIOC, M_ON)

#define ATE0 "ATE0\x00D\x00A"
#define CHECK_COPN "AT+COPN=?"
#define GET_CONPN "AT+COPN"
#define CHECK_COPS "AT+COPS=?"
#define GET_REGESTERED_COPS "AT+COPS?"
#define SET_CREG "AT+CREG=0" /* 8.3.3 */

#define CHECK_SICS "AT^SICS=?\x00D\x00A"	/* 10.1.1 */
#define SET_NETTYPE "AT^SICS=0,conType,GPRS0\x00D\x00A"	/* 10.1.3 */
#define SET_APNTYPE "AT^SICS=0,apn,3GNET\x00D\x00A"
#define SET_SRVTYPE "AT^SISS=0,srvType,Socket\x00D\x00A"
#define SET_CONID "AT^SISS=0,conId,0\x00D\x00A"
#define SET_SRV_URL_1 "AT^SISS=0,address,\"socktcp://113.105.139.109:6969\"\x00D\x00A"
//#define SET_SRV_URL_1 "AT^SISS=0,address,\"socktcp://203.88.202.116:7788\"\x00D\x00A"
#define OPEN_CON0 "AT^SISO=0\x00D\x00A"
#define CLOSE_CON0 "AT^SISC=0\x00D\x00A"
#define GET_IMEI "AT+CGSN\x00D\x00A"
#define MG323_TP_TRANS "AT^IPENTRANS=0\x00D\x00A"

#define GPRS_RXNE_IRQ_ENABLE() USART_ITConfig(USART1, USART_IT_RXNE, ENABLE)
#define GPRS_RXNE_IRQ_DISABLE() USART_ITConfig(USART1, USART_IT_RXNE, DISABLE)

typedef enum{
	GPRS_STATUS_NOINIT,
	GRPS_STATUS_START,	/* 等待GPRS模块发送^SYSSTART */
	GPRS_STATUS_ATE,
	GPRS_STATUS_GET_IMEI,
	GPRS_STATUS_NETTYPE,
	GPRS_STATUS_APNTYPE,
	GPRS_STATUS_SRVTYPE,
	GPRS_STATUS_CONID,
	GPRS_STATUS_SRVURL,
	GPRS_STATUS_SOCKET_OPEN,
	GPRS_STATUS_SOCKET_OPEN_SUCC,
	GPRS_STATUS_SOCKET_TP,
	GPRS_STATUS_SOCKET_TP_SUCC,
	GPRS_STATUS_SOCKET_TP_SEND_CAM,
	GPRS_STATUS_SOCKET_TP_SEND_GPS,
	GPRS_STATUS_SOCKET_TP_SEND_MSG,
	GPRS_STATUS_SOCKET_TP_FINISH,
	GPRS_STATUS_SOCKET_WRITE,
	GPRS_STATUS_SOCKET_WRITE_MSG,
	GPRS_STATUS_SOCKET_WILL_CLOSED,
	GPRS_STATUS_SOCKET_READ,
	GPRS_STATUS_SOCKET_CLOSE,
	GPRS_STATUS_SOCKET_CLOSE_OK,

	GPRS_STATUS_MAX,
}GPRS_MODULE_STATUS;

struct _gprs_info{
	bool ate0;
	uint8_t imei[15];
	bool send_imei_now;
	GPRS_MODULE_STATUS gprs_status;
	struct {
		bool in_tp_mode;
		bool quit_socket;
		bool sec_msg;	/* 第二次发送数据 */
		bool socket_opend;
		bool socket_closed_by_srv;
		uint32_t session_max_len;
	}send_status;
	struct {
		uint8_t rbuf[GPRS_MAX_MSG_LEN];
		/*uint8_t*/ uint16_t rbuf_index;
	}rbuf_info;
	uint32_t tmpbuf_len;
	uint32_t tmpbuf2_len;
	uint8_t tmpbuf[GPRS_MAX_MSG_LEN];
	uint8_t tmpbuf2[GPRS_MAX_MSG_LEN];
	struct {
		uint8_t sbuf[GPRS_MAX_MSG_LEN];
		uint8_t sbuf_len;
		uint8_t gps_sbuf[GPS_MAX_MSG_LEN];
		uint8_t gps_sbuf_len;
	}sbuf_info;
};
struct _gprs_info gprs_info;

extern volatile unsigned int Timer1, Timer2;

#define SEQED_MSGS_MAX_LEN 64
#define SEQED_MSGS_MAX_NUM 10
struct _seqed_msgs {
	uint8_t msgs[SEQED_MSGS_MAX_NUM][SEQED_MSGS_MAX_LEN];
	uint8_t msgtmp[SEQED_MSGS_MAX_LEN];
	uint32_t msgtmp_len;
	uint8_t msgs_num;
	uint32_t gprs_rbuf_point;
};
struct _seqed_msgs seqed_msgs;
void lw_seqed_msgs_init(void)
{
	uint32_t i;

	seqed_msgs.msgtmp_len = 0;
	seqed_msgs.msgs_num = 0;
	seqed_msgs.gprs_rbuf_point = 0;
	for (i=0; i<SEQED_MSGS_MAX_NUM; i++)
		memset(seqed_msgs.msgs, '\0', SEQED_MSGS_MAX_LEN);
}

void lw_clean_seqed_msgs(void)
{
	uint32_t i;

	seqed_msgs.msgs_num = 0;
	for (i=0; i<SEQED_MSGS_MAX_NUM; i++)
		memset(seqed_msgs.msgs[i], '\0', SEQED_MSGS_MAX_LEN);
}
static void get_seqed_msgs(uint32_t start, uint32_t end)
{
	static bool newline = false;
	uint32_t i;
	uint8_t *p;

	p = gprs_info.rbuf_info.rbuf;
	p += start;
	for (i=0; i<end-start; i++) {
		if ((p[i] == 0x0D) || (p[i] == 0x0A)) {
			
			if (!newline) {
				if (seqed_msgs.msgtmp_len) {
					memcpy(seqed_msgs.msgs[seqed_msgs.msgs_num++], 
						seqed_msgs.msgtmp, seqed_msgs.msgtmp_len);
				}
				if (seqed_msgs.msgs_num >= SEQED_MSGS_MAX_NUM)
					seqed_msgs.msgs_num = 0;
			}
			seqed_msgs.msgtmp_len = 0;
			newline = true;
		}
		else {
			newline = false;	
			seqed_msgs.msgtmp[seqed_msgs.msgtmp_len++] = p[i];
		}
	}
}

static void lw_form_seqed_msgs(void)
{
	uint32_t gindex;
	uint32_t spoint;
	
	gindex = gprs_info.rbuf_info.rbuf_index;
	spoint = seqed_msgs.gprs_rbuf_point;
	if (gindex == spoint)
		return ;
	if (gindex > spoint) {
		get_seqed_msgs(spoint, gindex);
	}
	else {
		get_seqed_msgs(spoint, GPRS_MAX_MSG_LEN - 1);
		get_seqed_msgs(0, gindex);
	}

	seqed_msgs.gprs_rbuf_point = gindex;
}

static bool lw_get_seqed_msg(uint8_t *p)
{
	uint32_t i;
	
	for(i=0;i<seqed_msgs.msgs_num;i++) {
		if (strstr(seqed_msgs.msgs[i], p))
			return true;
	}

	return false;
}


static void lw_clean_gprs_sbuf(void)
{
	gprs_info.sbuf_info.sbuf_len = 0;
	memset(gprs_info.sbuf_info.sbuf, 0, GPRS_MAX_MSG_LEN);
}

void lw_set_gprs_sbuf(uint8_t *msg)
{
	gprs_info.sbuf_info.sbuf_len = strlen(msg);
	strcpy(gprs_info.sbuf_info.sbuf, msg);
}

int32_t lw_is_sbuf_empty(void)
{
	return ((gprs_info.sbuf_info.sbuf_len > 0) ? 0:1);
}

static void lw_clean_gprs_rbuf(void)
{
	USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
	memset(gprs_info.rbuf_info.rbuf, 0, sizeof(gprs_info.rbuf_info.rbuf)/sizeof(gprs_info.rbuf_info.rbuf[0]));
	gprs_info.rbuf_info.rbuf_index = 0;
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
}

void lw_gprs_init(void)
{
	com_para_t com_para;
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOC, ENABLE);
	//RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOC, ENABLE);//测试

	GPIO_InitStructure.GPIO_Pin = M_RST|M_ON;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	MG323_POWERSWITCH();
	MG323_NORM();


	//测试
	/*GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9 | GPIO_Pin_10;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_SetBits(GPIOA, GPIO_Pin_9);
	GPIO_SetBits(GPIOA, GPIO_Pin_10);	*/
	
	/* uart init */	
	com_para.baudrate = 115200;
	com_para.data_9bit = false;
	com_para.parity = 0;
	com_para.port = 1;//2;
	com_para.twoStopBits = false;
	com_init(&com_para);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	GPIO_SetBits(GPIOC, GPIO_Pin_7);
}

void lw_start_gprs_mode(void)
{
	memset(&gprs_info, 0, sizeof(gprs_info));
	gprs_info.send_imei_now = true;
	gprs_info.gprs_status = GPRS_STATUS_NOINIT;
	gprs_info.ate0 = 0;
	gprs_info.send_status.quit_socket = false;
	gprs_info.send_status.in_tp_mode = false;
	lw_clean_gprs_sbuf();
	lw_clean_gprs_rbuf();
	
