ghye/stm32_car/lw_gprs.c
#if 0
	MG323_POWERSWITCH();
	delay(150);	/* >= 1S */
	MG323_POWERNORM();

	MG323_RESET();
	delay(100);	/* >= 10ms */
	MG323_NORM();
#endif
}

//#define gprs_send_cmd(x, y) com_send_string(x, y)
#define gprs_send_cmd(x, y,z ) com_send_nchar(x, y, z)

static void lw_gprs_waitfor_start(void)
{ 
	if(gprs_info.rbuf_info.rbuf_index < 20)
		return;
	if (NULL != strstr(gprs_info.rbuf_info.rbuf, "SYSSTART"))
	{
		memset(&gprs_info, 0, sizeof(gprs_info));
		gprs_info.ate0 = 0;
		gprs_info.gprs_status = GRPS_STATUS_START;
	}

	lw_clean_gprs_rbuf();
	return ;
}

/* 关闭回显*/
static void lw_send_ate0(void)
{
	lw_clean_gprs_rbuf();
	gprs_info.gprs_status = GPRS_STATUS_ATE;
	gprs_send_cmd(1, ATE0, strlen(ATE0));
}

static void lw_send_ate0_(void)
{
	gprs_info.gprs_status = GPRS_STATUS_ATE;
	gprs_send_cmd(1, ATE0, strlen(ATE0));
}

static void lw_send_get_imei(void)
{
	if(gprs_info.rbuf_info.rbuf[2]== 'O' && gprs_info.rbuf_info.rbuf[3] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_GET_IMEI;
		//lw_gprs_get_imei();
		gprs_send_cmd(1, GET_IMEI, strlen(GET_IMEI));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, ATE0, strlen(ATE0));
	}
}

static void lw_send_get_imei_(void)
{
	if(lw_get_seqed_msg("OK") /*返回OK*/)
	{
		gprs_info.gprs_status = GPRS_STATUS_GET_IMEI;
		//lw_gprs_get_imei();
		gprs_send_cmd(1, GET_IMEI, strlen(GET_IMEI));
	}
	else
	{
		gprs_send_cmd(1, ATE0, strlen(ATE0));
	}
}

static void lw_send_nettype(void)
{
	if(!lw_gprs_get_imei())
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_NETTYPE;
		gprs_send_cmd(1, SET_NETTYPE, strlen(SET_NETTYPE));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, GET_IMEI, strlen(GET_IMEI));
	}
}


static bool lw_gprs_get_imei_(void)
{
	uint32_t i;
	uint8_t tmp[20];
	
	for(i=0;i<seqed_msgs.msgs_num;i++) {
		if (isdigit(seqed_msgs.msgs[i][2]) && isdigit(seqed_msgs.msgs[i][10]) ) {
			memcpy(gprs_info.imei, seqed_msgs.msgs[i], 15);
			com_send_message(1, "imei:");
			memcpy(tmp, gprs_info.imei, 15);
			tmp[15] = '\0';
			com_send_message(1, tmp);

			return true;
		}
	}

	return false;
}

static void lw_send_nettype_(void)
{
	if(lw_gprs_get_imei_())
	{
		gprs_info.gprs_status = GPRS_STATUS_NETTYPE;
		gprs_send_cmd(1, SET_NETTYPE, strlen(SET_NETTYPE));
	}
	else
	{
		gprs_send_cmd(1, GET_IMEI, strlen(GET_IMEI));
	}
}

static void lw_send_apntype(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_APNTYPE;
		gprs_send_cmd(1, SET_NETTYPE, strlen(SET_NETTYPE));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_NETTYPE, strlen(SET_NETTYPE));
	}
}

static void lw_send_apntype_(void)
{
	if(lw_get_seqed_msg("OK")/*收到OK*/)
	{
		gprs_info.gprs_status = GPRS_STATUS_APNTYPE;
		gprs_send_cmd(1, SET_APNTYPE, strlen(SET_APNTYPE));
	}
	else
	{
		gprs_send_cmd(1, SET_NETTYPE, strlen(SET_NETTYPE));
	}
}

static void lw_send_srvtype(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_SRVTYPE;
		gprs_send_cmd(1, SET_SRVTYPE, strlen(SET_SRVTYPE));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_APNTYPE, strlen(SET_APNTYPE));
	}

}

static void lw_send_srvtype_(void)
{
	if(lw_get_seqed_msg("OK") /*收到OK*/)
	{
		gprs_info.gprs_status = GPRS_STATUS_SRVTYPE;
		gprs_send_cmd(1, SET_SRVTYPE, strlen(SET_SRVTYPE));
	}
	else
	{
		gprs_send_cmd(1, SET_APNTYPE, strlen(SET_APNTYPE));
	}

}

static void lw_send_conid(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_CONID;
		gprs_send_cmd(1, SET_CONID, strlen(SET_CONID));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_SRVTYPE, strlen(SET_SRVTYPE));
	}
}

static void lw_send_conid_(void)
{
	if(lw_get_seqed_msg("OK") /*收到OK*/)
	{
		gprs_info.gprs_status = GPRS_STATUS_CONID;
		gprs_send_cmd(1, SET_CONID, strlen(SET_CONID));
	}
	else
	{
		gprs_send_cmd(1, SET_SRVTYPE, strlen(SET_SRVTYPE));
	}
}

static void lw_send_srvurl(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_SRVURL;
		gprs_send_cmd(1, SET_SRV_URL_1, strlen(SET_SRV_URL_1));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_CONID, strlen(SET_CONID));
	}
}

static void lw_send_srvurl_(void)
{
	if(lw_get_seqed_msg("OK") /*收到OK*/)
	{
		gprs_info.gprs_status = GPRS_STATUS_SRVURL;
		gprs_send_cmd(1, SET_SRV_URL_1, strlen(SET_SRV_URL_1));
	}
	else
	{
		gprs_send_cmd(1, SET_CONID, strlen(SET_CONID));
	}
}

static void lw_send_socket_open(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_SOCKET_OPEN;
		gprs_send_cmd(1, OPEN_CON0, strlen(OPEN_CON0));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_SRV_URL_1, strlen(SET_SRV_URL_1));
	}
}

static void lw_send_socket_open_(void)
{
	if(lw_get_seqed_msg("OK") /*收到OK*/)
	{
		gprs_info.gprs_status = GPRS_STATUS_SOCKET_OPEN;
		gprs_send_cmd(1, OPEN_CON0, strlen(OPEN_CON0));
	}
	else
	{
		gprs_send_cmd(1, SET_SRV_URL_1, strlen(SET_SRV_URL_1));
	}
}

uint32_t pow10(uint32_t i)
{
    uint32_t ret;

    ret = 1;
    while(i-->0)
        ret *= 10;
    return ret;
}

static void lw_clear_gprs_ack_sentence(uint8_t *start)
{
	uint16_t tmp;
	uint16_t start_addr;
	uint8_t *p;

	p = start;
	while(*p != 0x0A) 
		p++;
	start_addr = p - gprs_info.rbuf_info.rbuf;
	GPRS_RXNE_IRQ_DISABLE();
	for(tmp = start_addr + 1; tmp < gprs_info.rbuf_info.rbuf_index; tmp++)
		gprs_info.rbuf_info.rbuf[tmp - (start_addr + 1)] = gprs_info.rbuf_info.rbuf[tmp];
	gprs_info.rbuf_info.rbuf_index -= (start_addr + 1);
	memset(gprs_info.rbuf_info.rbuf + gprs_info.rbuf_info.rbuf_index, 0, 
		GPRS_MAX_MSG_LEN - gprs_info.rbuf_info.rbuf_index);
	GPRS_RXNE_IRQ_ENABLE();
}

static void lw_gprs_check_socket_opend(void)
{
	uint8_t i;
	uint8_t *p;
	uint8_t *ptmp;


