ghye/stm32_car/lw_gprs.c
	}
}

#define CAM_CMD_L "L:%X#"
static int32_t lw_send_socket_tp_msg(void)
{
	extern volatile unsigned int Timer1, Timer2;

	#define TEST_CMD_A "A:%s#"
	#define TP_END_FLAG "+++"

	bool finish;
	uint32_t len;
	uint8_t buf[20];
	uint8_t imei[20];
	uint8_t *p;

	#define TP_GET_FRAME	0
	#define TP_SEND_PREMSG	1
	#define TP_SEND_MSG 	2
	#define TP_SEND_END 	3
	#define TP_FINISH	 	4
	static uint8_t step = TP_GET_FRAME; 

	
	#if 0
	static uint8_t cnt = 0;
	static uint8_t testtp[512];
	#endif

	switch (step) {
	case TP_GET_FRAME:
		if(!lw_cam_get_frame()) { /*ok*/
			step = TP_SEND_PREMSG;
		}
		break;
	case TP_SEND_PREMSG:
		/*传imei*/
		memcpy(imei, gprs_info.imei, 15);
		imei[15] = '\0';
		sprintf(buf,TEST_CMD_A, imei);
		gprs_send_cmd(1, buf, strlen(buf));

		/*传jpg长度*/
		sprintf(buf, CAM_CMD_L, lw_get_frame_len() + 5*2); /*5*2:头尾各5bytes*/
		//sprintf(buf, CAM_CMD_L, 8); /*5*2:头尾各5bytes*/
		gprs_send_cmd(1, buf, strlen(buf));

		/*使能jpg帧数据*/
		lw_cam_start_frame_();
		
		step = TP_SEND_MSG;
		break;
	case TP_SEND_MSG:
		lw_clean_gprs_rbuf(); /*FIXME:注意处理返回的信息*/
		
		/*传jpg数据*/
		#if 0
		gprs_send_cmd(1, "abcdefgh", 8);
		step = TP_SEND_END;
		#elif 0
		for(len=0;len<512;len++)	
			testtp[len] = len%10+'0';
		//for(len=0; len<30;len++) {
			gprs_send_cmd(1, testtp, 512);
			Timer1 = 100;
			while(Timer1) ;
		//}
		if (cnt++ >= 30) {
			step = TP_SEND_END;
			cnt = 0;
		}
		#else
		//lw_cam_start_frame_();
		//do {
			finish = lw_get_cam_data_to_gprs(&p, &len);
			if (len) {
				gprs_send_cmd(1, p, len);
			Timer1 = 200;
			while(Timer1) ;
			}
		//} while (false == finish); 
		
		if (true == finish) {
			lw_cam_stop_frame_();
			step = TP_SEND_END;
		}
		#endif

		break;
	case TP_SEND_END:
		lw_clean_gprs_rbuf(); /*FIXME:注意处理返回的信息*/
		
		/*结束符号+++*/
		Timer1 = 100;
		while(Timer1) ;
		gprs_send_cmd(1, TP_END_FLAG, strlen(TP_END_FLAG));
		Timer1 = 100;
		while(Timer1) ;
		
		step = TP_FINISH;
		break;
	case TP_FINISH:
		step = TP_GET_FRAME;
		gprs_info.gprs_status = GPRS_STATUS_SOCKET_TP_FINISH;
		break;
	default:
		break;
	}

	return 0;
}

static int32_t lw_set_socket_tp_mode_finish(void)
{
	if ((gprs_info.rbuf_info.rbuf_index < 6) || 
		(gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 1] != 0x0A))
		return -1;

	//gprs_info.rbuf_info.rbuf[GPRS_MAX_MSG_LEN - 1] = '\0';
	//if (strstr(gprs_info.rbuf_info.rbuf, "OK") != NULL) {	/*透传结束*/	
	if ((gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 3] == 'K') &&
		(gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 4] == 'O')) {
		if (is_send_cam() || is_send_gps())
			gprs_info.gprs_status = GPRS_STATUS_SOCKET_OPEN;
		else
			gprs_info.gprs_status = GPRS_STATUS_SOCKET_WILL_CLOSED;
		gprs_info.send_status.in_tp_mode = false;
		lw_clean_gprs_rbuf();
		debug_printf_m("end tp.");
	}
	else {
		lw_clean_gprs_rbuf();
	}

	debug_printf_m("lw_set_socket_tp_mode_finish");
	return 0;
}

static bool lw_gprs_send_cam(void)
{
	extern volatile unsigned int Timer1, Timer2;

	#define TEST_CMD_A "A:%s#"
	#define TP_END_FLAG "+++"

	bool finish;
	uint32_t len;
	uint8_t buf[20];
	uint8_t imei[20];
	uint8_t *p;

	#define TP_GET_FRAME	0
	#define TP_SEND_PREMSG	1
	#define TP_SEND_MSG 	2
	#define TP_SEND_END 	3
	#define TP_FINISH	 	4
	static uint8_t step = TP_GET_FRAME; 

	
	#if 0
	static uint8_t cnt = 0;
	static uint8_t testtp[512];
	#endif

	switch (step) {
	case TP_GET_FRAME:
		if(!lw_cam_get_frame()) { /*ok*/
			step = TP_SEND_PREMSG;
		}
		break;
	case TP_SEND_PREMSG:
		/*传imei*/
		memcpy(imei, gprs_info.imei, 15);
		imei[15] = '\0';
		sprintf(buf,TEST_CMD_A, imei);
		gprs_send_cmd(1, buf, strlen(buf));

		/*传jpg长度*/
		sprintf(buf, CAM_CMD_L, lw_get_frame_len() + 5*2); /*5*2:头尾各5bytes*/
		//sprintf(buf, CAM_CMD_L, 8); /*5*2:头尾各5bytes*/
		gprs_send_cmd(1, buf, strlen(buf));

		/*使能jpg帧数据*/
		lw_cam_start_frame_();
		
		step = TP_SEND_MSG;
		break;
	case TP_SEND_MSG:
		/*传jpg数据*/
		#if 0
		gprs_send_cmd(1, "abcdefgh", 8);
		step = TP_SEND_END;
		#elif 0
		for(len=0;len<512;len++)	
			testtp[len] = len%10+'0';
		//for(len=0; len<30;len++) {
			gprs_send_cmd(1, testtp, 512);
			Timer1 = 100;
			while(Timer1) ;
		//}
		if (cnt++ >= 30) {
			step = TP_SEND_END;
			cnt = 0;
		}
		#else
		//lw_cam_start_frame_();
		//do {
			finish = lw_get_cam_data_to_gprs(&p, &len);
			if (len) {
				gprs_send_cmd(1, p, len);
				Timer1 = 200;
				while(Timer1) ;
			}
		//} while (false == finish); 
		
		if (true == finish) {
			lw_cam_stop_frame_();
			step = TP_SEND_END;
		}
		#endif

		break;
	case TP_SEND_END:
		/*结束符号+++*/
		Timer1 = 100;
		while(Timer1) ;
		gprs_send_cmd(1, TP_END_FLAG, strlen(TP_END_FLAG));
		Timer1 = 100;
		while(Timer1) ;
		
		step = TP_FINISH;
		break;
	case TP_FINISH:
		step = TP_GET_FRAME;
		return true;
		break;
	default:
		break;
	}

	return false;
}

static bool lw_gprs_send_cam_(void)
{
	extern volatile unsigned int Timer1, Timer2;

	#define TEST_CMD_A "A:%s#"
	#define TP_END_FLAG "+++"

	bool finish;
	uint32_t len;
	uint8_t buf[20];
	uint8_t imei[20];
	uint8_t *p;

	#define TP_GET_FRAME	0
	#define TP_SEND_PREMSG	1
	#define TP_SEND_MSG 	2
	#define TP_SEND_END 	3
	#define TP_FINISH	 	4
	static uint8_t step = TP_GET_FRAME; 

	
	#if 0
	static uint8_t cnt = 0;
	static uint8_t testtp[512];
	#endif

	switch (step) {
	case TP_GET_FRAME:
		if(!lw_cam_get_frame()) { /*ok*/
			step = TP_SEND_PREMSG;
		}
		break;
	case TP_SEND_PREMSG:
		/*传imei*/
		memcpy(imei, gprs_info.imei, 15);
		imei[15] = '\0';
		sprintf(buf,TEST_CMD_A, imei);
		gprs_send_cmd(1, buf, strlen(buf));

		/*传jpg长度*/
		sprintf(buf, CAM_CMD_L, lw_get_frame_len() + 5*2); /*5*2:头尾各5bytes*/
		//sprintf(buf, CAM_CMD_L, 8); /*5*2:头尾各5bytes*/
		gprs_send_cmd(1, buf, strlen(buf));

		/*使能jpg帧数据*/
		lw_cam_start_frame_();
		
		step = TP_SEND_MSG;
		break;
	case TP_SEND_MSG:
		/*传jpg数据*/
		#if 0
		gprs_send_cmd(1, "abcdefgh", 8);
		step = TP_SEND_END;
		#elif 0
		for(len=0;len<512;len++)	
			testtp[len] = len%10+'0';
		//for(len=0; len<30;len++) {
			gprs_send_cmd(1, testtp, 512);
			Timer1 = 100;
			while(Timer1) ;
		//}
		if (cnt++ >= 30) {
			step = TP_SEND_END;
			cnt = 0;
		}
		#else
		//lw_cam_start_frame_();
		//do {
			finish = lw_get_cam_data_to_gprs(&p, &len);
			if (len) {
				gprs_send_cmd(1, p, len);
				Timer1 = 200;
				while(Timer1) ;
			}
		//} while (false == finish); 
		
		if (true == finish) {
			lw_cam_stop_frame_();
			step = TP_FINISH;
		}
		#endif

		break;

	case TP_FINISH:
		step = TP_GET_FRAME;
		return true;
		break;
	default:
		break;
	}

