ghye/stm32_car/lw_gprs.c
	return false;
}

static bool lw_gprs_sending_gps(uint8_t *buf, uint32_t buflen)
{
	gprs_send_cmd(1, buf, buflen);

	return true;
}

static bool lw_gprs_close(void)
{
	gprs_send_cmd(1, CLOSE_CON0, strlen(CLOSE_CON0));
}

static void lw_check_gprs_close(void)
{	
	if(lw_get_seqed_msg("OK") /*返回OK*/)
	{
		gprs_info.gprs_status = GPRS_STATUS_NOINIT;
	}
	else if (lw_get_seqed_msg("ERROR")){
		gprs_send_cmd(1, CLOSE_CON0, strlen(CLOSE_CON0));
	}
	else {
		gprs_send_cmd(1, CLOSE_CON0, strlen(CLOSE_CON0));
	}
}

int32_t lw_gprs_tcp_create_send(void)
{
	int32_t  ret;
	//gprs_info.gprs_status = GPRS_STATUS_NOINIT;

/*	if(lw_is_sbuf_empty())
		return -1;*/
		
/*	if(gprs_info.ate0 == 0)
	{
		com_send_message(1, "\r\n");
		com_send_message(1, "rbuf_index:");
		com_send_hex(1, gprs_info.rbuf_info.rbuf_index);
		com_send_message(1, "\r\n");
		for(i=0;i<gprs_info.rbuf_info.rbuf_index;i++)
			com_send_hex(1, gprs_info.rbuf_info.rbuf[i]);
		com_send_message(1, "\r\n");
		
		if(gprs_info.rbuf_info.rbuf[2] == 'O' && gprs_info.rbuf_info.rbuf[3] == 'K')
		{
			lw_clean_gprs_rbuf();
			gprs_info.ate0 = 1;
		}
		else
		{
			lw_clean_gprs_rbuf();
			lw_send_ate0();
			return -1;
		}
	}*/

	/* 因为gprs模块隔1~1.5分钟就重启 */
	/*if (NULL != strstr(gprs_info.rbuf_info.rbuf, "SYSSTART"))
	{
		gprs_info.ate0 = 0;
		gprs_info.gprs_status = GPRS_STATUS_NOINIT;
		//lw_clean_gprs_rbuf();
		//return -2;
	}*/
	if(gprs_info.rbuf_info.rbuf[0] != 0 &&
		gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 1] !=  0x0A ){
		//&& !is_send_cam2pgrs()){
		return -1; /* 未接收完信息 */
	}
		
	if (true == lw_gprs_is_socket_closed()){
		gprs_info.send_status.socket_closed_by_srv = true;
		gprs_info.gprs_status = GPRS_STATUS_SOCKET_WILL_CLOSED;
		lw_clean_gprs_rbuf();
		//return -2;
	}

	/* FIXME:遇到过SISR */
	gprs_info.rbuf_info.rbuf[GPRS_MAX_MSG_LEN - 1] = '\0';
	if (strstr(gprs_info.rbuf_info.rbuf, "^SISR") == gprs_info.rbuf_info.rbuf + 2) {
		lw_clear_gprs_ack_sentence(gprs_info.rbuf_info.rbuf + 2);	/* 删除这个 */
		return -1;
	}

	gprs_info.rbuf_info.rbuf[GPRS_MAX_MSG_LEN - 1] = '\0';
	if ((strstr(gprs_info.rbuf_info.rbuf, "SHUTDOWN") != NULL) || 
		(strstr(gprs_info.rbuf_info.rbuf, "SYSSTART") != NULL) ) {
		gprs_info.gprs_status = GPRS_STATUS_NOINIT;
		lw_clean_gprs_rbuf();
	}

	lw_check_gprs_stop();

	switch(gprs_info.gprs_status)
	{
		case GPRS_STATUS_NOINIT:
		/*	lw_gprs_waitfor_start();
			break;
		case GRPS_STATUS_START:*/
			lw_send_ate0();
			break;
		case GPRS_STATUS_ATE:
			lw_send_get_imei();
			break;
		case GPRS_STATUS_GET_IMEI:
			lw_send_nettype();
			break;
		case GPRS_STATUS_NETTYPE:
			lw_send_apntype();
			break;
		case GPRS_STATUS_APNTYPE:
			lw_send_srvtype();
			break;			
		case GPRS_STATUS_SRVTYPE:
			lw_send_conid();
			break;
		case GPRS_STATUS_CONID:
			lw_send_srvurl();
			break;
		case GPRS_STATUS_SRVURL:
			if (!is_send_cam() && !is_send_gps())
				break;
			lw_send_socket_open();
			break;
		case GPRS_STATUS_SOCKET_OPEN:
			if(true == gprs_info.send_status.quit_socket)	/* 退出 */
			{
				gprs_info.gprs_status = GPRS_STATUS_SOCKET_WILL_CLOSED;
				break;
			}

			if(gprs_info.send_status.socket_opend == false)
			{
				lw_gprs_check_socket_opend();
				break;
			}
			
			if(gprs_info.send_status.socket_opend == true) {
				if (is_send_cam()) {
					set_no_send_cam();
					lw_set_socket_tp_mode();
				}
				else
				if(is_send_gps() && (gprs_info.sbuf_info.sbuf_len > 0)) {
					if (false == gprs_info.send_imei_now) {
						set_no_send_gps();
					}
					gprs_info.send_imei_now = false;
					lw_send_socket_write(gprs_info.sbuf_info.sbuf_len);
				}
				/*else if (is_send_cam()) {
					set_no_send_cam();
					lw_set_socket_tp_mode();
				}*/
				/*else {
					lw_clean_gprs_rbuf();
					gprs_info.gprs_status = GPRS_STATUS_SOCKET_CLOSE;
				}*/
			}
			break;
		case GPRS_STATUS_SOCKET_TP:
			lw_send_socket_tp_mode();
			break;
		case GPRS_STATUS_SOCKET_TP_SEND_MSG:
			lw_send_socket_tp_msg();
			break;
		case GPRS_STATUS_SOCKET_TP_FINISH:
			lw_set_socket_tp_mode_finish();
			break;
		case GPRS_STATUS_SOCKET_WRITE:
			lw_send_socket_write_msg(gprs_info.sbuf_info.sbuf, 
				gprs_info.sbuf_info.sbuf_len);
			lw_clean_gprs_sbuf();
			if(true == gprs_info.send_status.socket_closed_by_srv){
				gprs_info.gprs_status = GPRS_STATUS_SOCKET_WILL_CLOSED;
			}
			break;
		case GPRS_STATUS_SOCKET_WRITE_MSG:
			ret = lw_gprs_check_socket_send_msg();
			if(ret == 0)
			{
				if (is_send_cam() || is_send_gps())
					gprs_info.gprs_status = GPRS_STATUS_SOCKET_OPEN;
				else {
					gprs_info.gprs_status = GPRS_STATUS_SOCKET_CLOSE;
					lw_clean_gprs_rbuf();
				}
			}
			else if(ret == -2)	/* 出错*/
			{
				gprs_info.gprs_status = GPRS_STATUS_SOCKET_WILL_CLOSED;
			}
			break;
		case GPRS_STATUS_SOCKET_WILL_CLOSED:
			lw_send_socket_close();
			break;
		case GPRS_STATUS_SOCKET_CLOSE:
			/*lw_clean_gprs_sbuf();*/

			/* 以下代码使得GPRS设备重新复位 */
			/*if (true == lw_reset_gprs()){
				gprs_info.gprs_status = GPRS_STATUS_MAX;
				memset(&gprs_info.send_status, 0, sizeof(gprs_info.send_status));
				lw_clean_gprs_rbuf();
			}*/

			/* 以下代码使得GPRS设备重新open链接 */
			lw_socked_end();
			break;			
		default:
			break;
	}

	return 0;
}

static void lw_gprs_send_tp_end(void)
{
	#define TP_END_FLAG "+++"

	Timer1 = 100;
	while(Timer1) ;
	gprs_send_cmd(1, TP_END_FLAG, strlen(TP_END_FLAG));
	Timer1 = 100;
	while(Timer1) ;
}

int32_t lw_gprs_tcp_create_send_(void)
{
	//int32_t  ret;

	switch(gprs_info.gprs_status)
	{
		case GPRS_STATUS_NOINIT:
			if (!is_send_cam() && !is_send_gps() && !(gprs_info.send_imei_now))
				break;
			lw_send_ate0_();
			break;
		case GPRS_STATUS_ATE:
			lw_send_get_imei_();
			break;
		case GPRS_STATUS_GET_IMEI:
			lw_send_nettype_();
			break;
		case GPRS_STATUS_NETTYPE:
			lw_send_apntype_();
			break;
		case GPRS_STATUS_APNTYPE:
			lw_send_srvtype_();
			break;			
		case GPRS_STATUS_SRVTYPE:
			lw_send_conid_();
			break;
		case GPRS_STATUS_CONID:
			lw_send_srvurl_();
			break;
		case GPRS_STATUS_SRVURL:
			lw_send_socket_open_();
			break;
		case GPRS_STATUS_SOCKET_OPEN:
			lw_gprs_check_socket_opend_succ();
			break;
		case GPRS_STATUS_SOCKET_OPEN_SUCC:
			lw_send_socket_tp_mode_();
			break;
		case GPRS_STATUS_SOCKET_TP:
			lw_gprs_check_socket_tp_mode_succ();
			break;
		case GPRS_STATUS_SOCKET_TP_SUCC:
			if (true == gprs_info.send_imei_now) {
				gprs_info.send_imei_now = false;
				gprs_info.gprs_status = GPRS_STATUS_SOCKET_TP_SEND_GPS;
			}
			else if (is_send_cam()) {
				set_no_send_cam();
				gprs_info.gprs_status = GPRS_STATUS_SOCKET_TP_SEND_CAM;
			}
			else if (is_send_gps() && (gprs_info.sbuf_info.sbuf_len > 0)) {
				set_no_send_gps();
				gprs_info.gprs_status = GPRS_STATUS_SOCKET_TP_SEND_GPS;
			}
			else { /*没得发*/
				//gprs_info.gprs_status = GPRS_STATUS_SOCKET_TP_FINISH;
			}

			break;
		case GPRS_STATUS_SOCKET_TP_SEND_CAM:
			if (lw_gprs_send_cam_()) {
				gprs_info.gprs_status = GPRS_STATUS_SOCKET_TP_SUCC;
			}	
			break;
		case GPRS_STATUS_SOCKET_TP_SEND_GPS:
			if (lw_gprs_sending_gps(gprs_info.sbuf_info.sbuf, gprs_info.sbuf_info.sbuf_len)) {
				gprs_info.gprs_status = GPRS_STATUS_SOCKET_TP_SUCC;
				lw_clean_gprs_sbuf();
			}
			break;
		case GPRS_STATUS_SOCKET_TP_FINISH:
			lw_gprs_send_tp_end();
			gprs_info.gprs_status = GPRS_STATUS_SOCKET_CLOSE;
			break;
		case GPRS_STATUS_SOCKET_CLOSE:
			lw_gprs_close();
			gprs_info.gprs_status = GPRS_STATUS_SOCKET_CLOSE_OK;
			break;			
		case GPRS_STATUS_SOCKET_CLOSE_OK:
			lw_check_gprs_close();
			break;
		default:
			break;
	}

	if (lw_get_seqed_msg("START"))
		gprs_info.gprs_status = GPRS_STATUS_NOINIT;
	//else if (lw_get_seqed_msg("closed") || (gprs_info.gprs_status ==GPRS_STATUS_SOCKET_OPEN))
	else if (lw_get_seqed_msg("closed")) {
		gprs_info.gprs_status = GPRS_STATUS_SOCKET_TP_FINISH;
	}
	return 0;
}

