ghye/stm32_car/lw_gprs.c
void lw_process_gprs_rbuf(uint8_t val)
{
	gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index++] = val;
	if(gprs_info.rbuf_info.rbuf_index >= GPRS_MAX_MSG_LEN)
		gprs_info.rbuf_info.rbuf_index = 0;
}

void lw_gprs_form_C_cmd(double lat, double lon, double speed, 
	double track/*航向*/, bool isvalid /*数据状态: 1:有效，0:无效*/)
{
	//#define C_STYPE "C:%f,%f,%f,%f,%d#"
	//#define C_STYPE "C:%f,%f,%f,%f,%d#"
	//#define C_STYPE "s:%f,%f,%f,%f,%d#"
	#define C_STYPE "s:%f,%f,%f,%f,%d,12345678#"
	//#define C_STYPE "s:%f,%f,1,2,%d,12345678#"
	//#define C_STYPE "s:2310.0216,11315.6558,000,096,1,12345678#"

	sprintf(gprs_info.sbuf_info.gps_sbuf, C_STYPE, lat, lon, speed, track, isvalid);
	gprs_info.sbuf_info.gps_sbuf_len = sizeof(gprs_info.sbuf_info.gps_sbuf);

	/*com_send_message(1, "C cmd:");
	com_send_message(1, gprs_info.sbuf_info.gps_sbuf);*/
}

static int32_t lw_set_sbuf_imei(void)
{

	#define TEST_CMD_A "A:123456789#"
	//#define TEST_CMD_A "D:123456789#"
	uint8_t A_tmp[50];
	uint8_t tmp[50];
	
	//if(lw_is_sbuf_empty())
	{
		//lw_set_gprs_sbuf(TEST_CMD_D);
		//lw_gprs_get_imei();
		if((gprs_info.imei[0])>'0' && (gprs_info.imei[1]>'0'))
		{		
			memcpy(A_tmp, gprs_info.imei, 15);
			A_tmp[15] = '\0';
			sprintf(tmp, "A:%s#", A_tmp);	
			//sprintf(tmp, "D:%s#", A_tmp);	
			lw_set_gprs_sbuf(tmp);
			//gprs_info.gprs_status = GPRS_STATUS_NETTYPE;
			gprs_info.send_imei_now = true;
			return 0;
		}
	}

	return -1;
}

int32_t lw_gprs_send_gps_test(void)
{
	if(gprs_info.gprs_status == GPRS_STATUS_APNTYPE)
	{
		/* 到这里，已经获得imei */
		if(lw_set_sbuf_imei() != 0 )
			return -1;
	}
	else if(gprs_info.gprs_status == GPRS_STATUS_SOCKET_WRITE)
	{
		
	}
	else if(gprs_info.gprs_status == GPRS_STATUS_SOCKET_CLOSE)
	{
		//gprs_info.gprs_status =GPRS_STATUS_SOCKET_WRITE; /* 可以重复发送 */
	}
	else if(gprs_info.gprs_status == GPRS_STATUS_MAX)
	{
			gprs_info.gprs_status = GPRS_STATUS_NOINIT;
	}

	if(lw_is_sbuf_empty())
		if(gprs_info.sbuf_info.gps_sbuf_len > 0)
		{
			lw_set_gprs_sbuf(gprs_info.sbuf_info.gps_sbuf);
			
			//return 0;
		}
		
	lw_gprs_tcp_create_send();			
	
	return 0;
}

int32_t lw_gprs_send_gps_test_(void)
{
	if(gprs_info.gprs_status == GPRS_STATUS_APNTYPE)
	{
		/* 到这里，已经获得imei */
		if(lw_set_sbuf_imei() != 0 )
			return -1;
	}
	if(lw_is_sbuf_empty())
		if(gprs_info.sbuf_info.gps_sbuf_len > 0)
		{
			lw_set_gprs_sbuf(gprs_info.sbuf_info.gps_sbuf);
			
			//return 0;
		}

	lw_clean_seqed_msgs();
	lw_form_seqed_msgs();
	lw_gprs_tcp_create_send_();
	
	
	return 0;
}


void test_gprs_1(void)
{
	#define TEST_CMD_D "D:123456789#"
	uint8_t D_tmp[25];
	uint8_t tmp[25];

	if(lw_is_sbuf_empty())
	{
		//lw_set_gprs_sbuf(TEST_CMD_D);
		//lw_gprs_get_imei();
		if((gprs_info.imei[0])>'0' && (gprs_info.imei[1]>'0'))
		{		
			memcpy(D_tmp, gprs_info.imei, 15);
			D_tmp[15] = '\0';
			sprintf(tmp, "D:%s#", D_tmp);	
			//sprintf(tmp, "A:%s#", D_tmp);	
			lw_set_gprs_sbuf(tmp);
			//gprs_info.gprs_status = GPRS_STATUS_NETTYPE;
		}
	}
	//else
	{
		lw_gprs_tcp_create_send();
	}
}


int32_t lw_gprs_send_cam_frame(void)
{
	//lw_send_socket_write();
	lw_cam_start_frame();

	while(lw_cam_stop_frame() != 0 ) ;
	lw_send_socket_write_msg(NULL, 0);
	
}

bool lw_gprs_isidle(void)
{
	bool isidle;

	if(gprs_info.send_status.socket_opend != true)	/* gprs not opened */
		isidle = false;
	else
		isidle = (lw_is_sbuf_empty() == 1) ? true: false;
	return isidle;
}


//#define CAM_CMD_L "L:%X#\x00D\x00A"
void lw_send_cam_cmd_L(uint32_t frame_len)
{
	uint8_t tmp[30];
	
	lw_clean_gprs_rbuf();

	/* 长度 */
	sprintf(tmp, CAM_CMD_L, frame_len);
	lw_send_socket_write(strlen(tmp));
	
	/* 内容 */
	gprs_send_cmd(1, tmp, strlen(tmp));	
}

void lw_grps_send_cam_frame_len(uint32_t frame_len)
{
	/* 长度 */
	lw_send_socket_write(frame_len);

	/* 内容由DMA */
}

uint8_t testgprs[512];
int32_t lw_cam_direct_to_gprs(void)
{
	extern volatile unsigned int Timer1, Timer2;

	#define TEST_CMD_A "D:%s#"
	#define TP_END_FLAG "+++"

	bool finish;
	uint8_t buf[20];
	uint8_t imei[20];
	uint32_t len;
	uint8_t *p;
	
for(len=0;len<512;len++)	
testgprs[len] = len%10+'0';

	if (is_tp_ready()) {
		if(lw_cam_get_frame())
			return -1;

		/*传imei*/
		memcpy(imei, gprs_info.imei, 15);
		imei[15] = '\0';
		sprintf(buf,TEST_CMD_A, imei);
		gprs_send_cmd(1, buf, strlen(buf));

		/*传jpg长度*/
		sprintf(buf, CAM_CMD_L, lw_get_frame_len() + 5*2); /*5*2:头尾各5bytes*/
		//sprintf(buf, CAM_CMD_L, 8); /*5*2:头尾各5bytes*/
		gprs_send_cmd(1, buf, strlen(buf));

		#if 0
		gprs_send_cmd(1, "abcdefgh", 8);
		#elif 1
		for(len=0; len<30;len++) {
			gprs_send_cmd(1, testgprs, 512);
			Timer1 = 100;
			while(Timer1) ;
		}
		#else
		lw_cam_start_frame_();
		do {
			finish = lw_get_cam_data_to_gprs(&p, &len);
			if (len) {
				gprs_send_cmd(1, p, len);
			}
		} while (false == finish); 
		#endif
		
		Timer1 = 100;
		while(Timer1) ;
		gprs_send_cmd(1, TP_END_FLAG, strlen(TP_END_FLAG));
		Timer1 = 100;
		//while(Timer1) ;
		while(1) ;
	}

	return 0;
}


